Revit 2027 API
ConnectorElement.SetLinkedConnectorElement Method
 Set the linked connector element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLinkedConnectorElement(
	ConnectorElement otherConnector
)
Public Sub SetLinkedConnectorElement (
	otherConnector As ConnectorElement
)
public:
void SetLinkedConnectorElement(
	ConnectorElement^ otherConnector
)
member SetLinkedConnectorElement :
        otherConnector : ConnectorElement -> unit
Parameters
otherConnector ConnectorElement
 The connector to link to.
Exceptions
Exception | Condition
ArgumentException |  The connector being linked to is a different domain than that of the calling connector. -or- The connector being linked to is the same as the calling connector.
InvalidOperationException |  This connector type does not support linked connectors.
Remarks
 Set the linked connector to null to remove the link.
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace